#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/utf9k-net/infrastructure/runs/run-QusZLAhc8kRRi7HA

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
cloudflare_zone.utf9k-zone: Refreshing state... [id=2117c58a86ea651fc35e585881e42c6e]
cloudflare_record.utf9k-net: Refreshing state... [id=09211e84c035dca74eff648c04f73bf2]
cloudflare_record.towing-utf9k-net: Refreshing state... [id=b8f9f6d888c1f8eab0c8396fa8083300]
cloudflare_record.www-utf9k-net: Refreshing state... [id=534268f7852f96b7fa149f24add14d1b]
cloudflare_record.october-utf9k-net: Refreshing state... [id=cd790002817b44581f65c281d82b4aaf]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # cloudflare_record.cname-dotfiles-utf9k-net will be created
  + resource "cloudflare_record" "cname-dotfiles-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "dotfiles.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "fervent-haibt-5ff3a9.netlify.app"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.cname-fm1-domainkey-utf9k-net will be created
  + resource "cloudflare_record" "cname-fm1-domainkey-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fm1._domainkey.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "fm1.utf9k.net.dkim.fmhosted.com"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.cname-fm2-domainkey-utf9k-net will be created
  + resource "cloudflare_record" "cname-fm2-domainkey-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fm2._domainkey.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "fm2.utf9k.net.dkim.fmhosted.com"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.cname-fm3-domainkey-utf9k-net will be created
  + resource "cloudflare_record" "cname-fm3-domainkey-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fm3._domainkey.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "fm3.utf9k.net.dkim.fmhosted.com"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.cname-gunslinger-utf9k-net will be created
  + resource "cloudflare_record" "cname-gunslinger-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "gunslinger.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "gunslinger.fly.dev"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.cname-img-utf9k-net will be created
  + resource "cloudflare_record" "cname-img-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "img.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "cname.cleanshot.cloud"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.cname-mail-utf9k-net will be created
  + resource "cloudflare_record" "cname-mail-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mail.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "app.fastmail.com"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.cname-mesmtp-domainkey-utf9k-net will be created
  + resource "cloudflare_record" "cname-mesmtp-domainkey-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mesmtp._domainkey.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "mesmtp.utf9k.net.dkim.fmhosted.com"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.cname-october-utf9k-net will be created
  + resource "cloudflare_record" "cname-october-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "october.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "friendly-saha-809ec9.netlify.app"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.cname-towing-utf9k-net will be created
  + resource "cloudflare_record" "cname-towing-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "towing.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "superlative-nougat-842bb4.netlify.app"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.cname-utf9k-net will be created
  + resource "cloudflare_record" "cname-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "nervous-elion-5370f7.netlify.app"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.cname-www-utf9k-net will be created
  + resource "cloudflare_record" "cname-www-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "nervous-elion-5370f7.netlify.app"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.mx-smtp10-utf9k-net will be created
  + resource "cloudflare_record" "mx-smtp10-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "utf9k.net"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "MX"
      + value           = "in1-smtp.messagingengine.com"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.mx-smtp20-utf9k-net will be created
  + resource "cloudflare_record" "mx-smtp20-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "utf9k.net"
      + priority        = 20
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "MX"
      + value           = "in2-smtp.messagingengine.com"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.october-utf9k-net will be destroyed
  # (because cloudflare_record.october-utf9k-net is not in configuration)
  - resource "cloudflare_record" "october-utf9k-net" {
      - allow_overwrite = false -> null
      - created_on      = "2022-12-25T08:21:50.37027Z" -> null
      - hostname        = "october.utf9k.net" -> null
      - id              = "cd790002817b44581f65c281d82b4aaf" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2022-12-25T08:21:50.37027Z" -> null
      - name            = "october.utf9k.net" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - ttl             = 3600 -> null
      - type            = "CNAME" -> null
      - value           = "friendly-saha-809ec9.netlify.app" -> null
      - zone_id         = "2117c58a86ea651fc35e585881e42c6e" -> null
    }

  # cloudflare_record.srv-caldav-tcp-utf9k-net will be created
  + resource "cloudflare_record" "srv-caldav-tcp-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_caldav._tcp.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "SRV"
      + value           = (known after apply)
      + zone_id         = (known after apply)

      + data {
          + name     = "utf9k.net"
          + port     = 0
          + priority = 0
          + proto    = "_tcp"
          + service  = "_caldav"
          + target   = "."
          + weight   = 0
        }
    }

  # cloudflare_record.srv-caldavs-tcp-utf9k-net will be created
  + resource "cloudflare_record" "srv-caldavs-tcp-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_caldavs._tcp.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "SRV"
      + value           = (known after apply)
      + zone_id         = (known after apply)

      + data {
          + name     = "utf9k.net"
          + port     = 443
          + priority = 0
          + proto    = "_tcp"
          + service  = "_caldavs"
          + target   = "caldav.fastmail.com"
          + weight   = 1
        }
    }

  # cloudflare_record.srv-carddav-tcp-utf9k-net will be created
  + resource "cloudflare_record" "srv-carddav-tcp-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_carddav._tcp.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "SRV"
      + value           = (known after apply)
      + zone_id         = (known after apply)

      + data {
          + name     = "utf9k.net"
          + port     = 0
          + priority = 0
          + proto    = "_tcp"
          + service  = "_carddav"
          + target   = "."
          + weight   = 0
        }
    }

  # cloudflare_record.srv-carddavs-tcp-utf9k-net will be created
  + resource "cloudflare_record" "srv-carddavs-tcp-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_carddavs._tcp.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "SRV"
      + value           = (known after apply)
      + zone_id         = (known after apply)

      + data {
          + name     = "utf9k.net"
          + port     = 443
          + priority = 0
          + proto    = "_tcp"
          + service  = "_carddavs"
          + target   = "carddav.fastmail.com"
          + weight   = 1
        }
    }

  # cloudflare_record.srv-imap-tcp-utf9k-net will be created
  + resource "cloudflare_record" "srv-imap-tcp-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_imap._tcp.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "SRV"
      + value           = (known after apply)
      + zone_id         = (known after apply)

      + data {
          + name     = "utf9k.net"
          + port     = 0
          + priority = 0
          + proto    = "_tcp"
          + service  = "_imap"
          + target   = "."
          + weight   = 0
        }
    }

  # cloudflare_record.srv-imaps-tcp-utf9k-net will be created
  + resource "cloudflare_record" "srv-imaps-tcp-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_imaps._tcp.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "SRV"
      + value           = (known after apply)
      + zone_id         = (known after apply)

      + data {
          + name     = "utf9k.net"
          + port     = 993
          + priority = 0
          + proto    = "_tcp"
          + service  = "_imaps"
          + target   = "imap.fastmail.com"
          + weight   = 1
        }
    }

  # cloudflare_record.srv-jmap-tcp-utf9k-net will be created
  + resource "cloudflare_record" "srv-jmap-tcp-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_jmap._tcp.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "SRV"
      + value           = (known after apply)
      + zone_id         = (known after apply)

      + data {
          + name     = "utf9k.net"
          + port     = 443
          + priority = 0
          + proto    = "_tcp"
          + service  = "_jmap"
          + target   = "jmap.fastmail.com"
          + weight   = 1
        }
    }

  # cloudflare_record.srv-pop3-tcp-utf9k-net will be created
  + resource "cloudflare_record" "srv-pop3-tcp-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_pop3._tcp.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "SRV"
      + value           = (known after apply)
      + zone_id         = (known after apply)

      + data {
          + name     = "utf9k.net"
          + port     = 0
          + priority = 0
          + proto    = "_tcp"
          + service  = "_pop3"
          + target   = "."
          + weight   = 0
        }
    }

  # cloudflare_record.srv-pop3s-tcp-utf9k-net will be created
  + resource "cloudflare_record" "srv-pop3s-tcp-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_pop3s._tcp.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "SRV"
      + value           = (known after apply)
      + zone_id         = (known after apply)

      + data {
          + name     = "utf9k.net"
          + port     = 995
          + priority = 10
          + proto    = "_tcp"
          + service  = "_pop3s"
          + target   = "pop.fastmail.com"
          + weight   = 1
        }
    }

  # cloudflare_record.srv-submission-tcp-utf9k-net will be created
  + resource "cloudflare_record" "srv-submission-tcp-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_submission._tcp.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "SRV"
      + value           = (known after apply)
      + zone_id         = (known after apply)

      + data {
          + name     = "utf9k.net"
          + port     = 587
          + priority = 0
          + proto    = "_tcp"
          + service  = "_submission"
          + target   = "smtp.fastmail.com"
          + weight   = 1
        }
    }

  # cloudflare_record.towing-utf9k-net will be destroyed
  # (because cloudflare_record.towing-utf9k-net is not in configuration)
  - resource "cloudflare_record" "towing-utf9k-net" {
      - allow_overwrite = false -> null
      - created_on      = "2022-12-25T08:21:49.922827Z" -> null
      - hostname        = "towing.utf9k.net" -> null
      - id              = "b8f9f6d888c1f8eab0c8396fa8083300" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2022-12-25T08:21:49.922827Z" -> null
      - name            = "towing.utf9k.net" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - ttl             = 3600 -> null
      - type            = "CNAME" -> null
      - value           = "superlative-nougat-842bb4.netlify.app" -> null
      - zone_id         = "2117c58a86ea651fc35e585881e42c6e" -> null
    }

  # cloudflare_record.txt-acme-utf9k-net will be created
  + resource "cloudflare_record" "txt-acme-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_acme-challenge.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = "utf9k.net.6139j.flydns.net"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.txt-acme-www-utf9k-net will be created
  + resource "cloudflare_record" "txt-acme-www-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_acme-challenge.www.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = "www.utf9k.net.6139j.flydns.net."
      + zone_id         = (known after apply)
    }

  # cloudflare_record.txt-google1-utf9k-net will be created
  + resource "cloudflare_record" "txt-google1-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = "google-site-verification=oU0N55oEkyi5hYWzzQNZwdBmCwDr9Q8np0PJ2ISplH0"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.txt-google2-utf9k-net will be created
  + resource "cloudflare_record" "txt-google2-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = "google-site-verification=7XQmc_jmbYCEvj_SYEgLCZj-8XBYcdK2RykDlZH2lns"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.txt-greeting-utf9k-net will be created
  + resource "cloudflare_record" "txt-greeting-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = "Poking around? Feel free to email me at dns@utf9k.net"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.txt-keybase-utf9k-net will be created
  + resource "cloudflare_record" "txt-keybase-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = "keybase-site-verification=3Otbmwt5ONpRiIpZVcBQKSKNJGfuA0PFNYFxc5d88XI"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.txt-spf-utf9k-net will be created
  + resource "cloudflare_record" "txt-spf-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "TXT"
      + value           = "v=spf1 include:spf.messagingengine.com ?all"
      + zone_id         = (known after apply)
    }

  # cloudflare_record.utf9k-net will be destroyed
  # (because cloudflare_record.utf9k-net is not in configuration)
  - resource "cloudflare_record" "utf9k-net" {
      - allow_overwrite = false -> null
      - created_on      = "2022-12-25T08:21:50.183867Z" -> null
      - hostname        = "utf9k.net" -> null
      - id              = "09211e84c035dca74eff648c04f73bf2" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2022-12-25T08:21:50.183867Z" -> null
      - name            = "utf9k.net" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - ttl             = 3600 -> null
      - type            = "CNAME" -> null
      - value           = "nervous-elion-5370f7.netlify.app" -> null
      - zone_id         = "2117c58a86ea651fc35e585881e42c6e" -> null
    }

  # cloudflare_record.www-utf9k-net will be destroyed
  # (because cloudflare_record.www-utf9k-net is not in configuration)
  - resource "cloudflare_record" "www-utf9k-net" {
      - allow_overwrite = false -> null
      - created_on      = "2022-12-25T08:21:50.662765Z" -> null
      - hostname        = "www.utf9k.net" -> null
      - id              = "534268f7852f96b7fa149f24add14d1b" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2022-12-25T08:21:50.662765Z" -> null
      - name            = "www.utf9k.net" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - ttl             = 3600 -> null
      - type            = "CNAME" -> null
      - value           = "nervous-elion-5370f7.netlify.app" -> null
      - zone_id         = "2117c58a86ea651fc35e585881e42c6e" -> null
    }

  # cloudflare_zone.utf9k-net-zone will be created
  + resource "cloudflare_zone" "utf9k-net-zone" {
      + account_id          = "8e782a355544971b192db9e75d789dca"
      + id                  = (known after apply)
      + meta                = (known after apply)
      + name_servers        = (known after apply)
      + paused              = false
      + plan                = (known after apply)
      + status              = (known after apply)
      + type                = "full"
      + vanity_name_servers = (known after apply)
      + verification_key    = (known after apply)
      + zone                = "utf9k.net"
    }

  # cloudflare_zone.utf9k-zone will be destroyed
  # (because cloudflare_zone.utf9k-zone is not in configuration)
  - resource "cloudflare_zone" "utf9k-zone" {
      - account_id          = "8e782a355544971b192db9e75d789dca" -> null
      - id                  = "2117c58a86ea651fc35e585881e42c6e" -> null
      - meta                = {
          - "phishing_detected"  = false
          - "wildcard_proxiable" = false
        } -> null
      - name_servers        = [
          - "dee.ns.cloudflare.com",
          - "stan.ns.cloudflare.com",
        ] -> null
      - paused              = false -> null
      - plan                = "free" -> null
      - status              = "pending" -> null
      - type                = "full" -> null
      - vanity_name_servers = [] -> null
      - zone                = "utf9k.net" -> null
    }

Plan: 32 to add, 0 to change, 5 to destroy.


```

</details>